## 판다스 자료 구조
- pandas는 DataFrame과 Series의 2가지 데이터 형태를 가짐
    - DataFrame : 2차원 형태 (table)
    - Series : 1차원 형태
    - 하나 이상의 Series가 합쳐진 형태가 DataFrame
- **dtype**
    - data type
    - 데이터프레임.dtypes 
    ```
    ---------------------
     dtype      python
    ---------------------
     int64      int
     float64    float
     bool       bool
     object     str
     datetime   datetime
     category     -
    ---------------------
    ```

In [1]:
import pandas as pd

In [24]:
df = pd.DataFrame(
    [
        range(1,7,2),
        range(2,7,2),
        range(10,31,10)
    ], 
    columns=[f'co{r}'for r in range(1,4)]
)
df

   co1  co2  co3
0    1    3    5
1    2    4    6
2   10   20   30

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     3 non-null      int64
 1   co2     3 non-null      int64
 2   co3     3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [5]:
type(df)

pandas.core.frame.DataFrame

In [12]:
# 길이 : 행 개수
len(df)

3

In [13]:
# 행과 열
df.shape

(3, 3)

In [14]:
# 행 개수
df.shape[0]

3

In [15]:
# 열 개수
df.shape[1]

3

In [25]:
# 마지막 행에 추가
df.loc[len(df)] = [50, 50, '오십']
df

   co1  co2 co3
0    1    3   5
1    2    4   6
2   10   20  30
3   50   50  오십

In [17]:
df.dtypes

co1     int64
co2     int64
co3    object
dtype: object

In [18]:
type(df.co3)

pandas.core.series.Series

In [19]:
type(df.co3[0])

int

In [20]:
type(df.co3[3])

str

In [26]:
# co2의 20을 20.5로 변경
df.loc[2, 'co2'] = 20.5
df

   co1   co2 co3
0    1   3.0   5
1    2   4.0   6
2   10  20.5  30
3   50  50.0  오십

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     4 non-null      int64
 1   co2     4 non-null      float64
 2   co3     4 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [29]:
type(df.co2[0])

numpy.float64

In [36]:
# 컬럼 co1의 2를 결측치(NaN : Not a Number)로 변경
import numpy as np
# df.co1[1] = np.nan
df.loc[1, 'co1'] = np.nan
df

    co1   co2  co3
0   1.0   3.0    5
1   NaN   4.0  6.5
2  10.0  20.5   30
3  50.0  50.0   오십

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   co1     3 non-null      float64
 1   co2     4 non-null      float64
 2   co3     4 non-null      object
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes

In [33]:
# 컬럼 co3의 6을 6.5로 변경
# 문자가 들어가 있어서 실수가 들어가도 다른 co3 값이 실수형으로 바뀌지 않음
df.loc[1, 'co3'] = 6.5
df

    co1   co2  co3
0   1.0   3.0    5
1   NaN   4.0  6.5
2  10.0  20.5   30
3  50.0  50.0   오십